CSI API ETABS v1
cAnalyze.DeleteResults Method
 Deletes results for load cases.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int DeleteResults(
	string Name,
	bool All = false
)
Function DeleteResults (
	Name As String,
	Optional All As Boolean = false
) As Integer
Dim instance As cAnalyze
Dim Name As String
Dim All As Boolean
Dim returnValue As Integer
returnValue = instance.DeleteResults(Name,
	All)
int DeleteResults(
	String^ Name,
	bool All = false
)
abstract DeleteResults :
        Name : string *
        ?All : bool
(* Defaults:
        let _All = defaultArg All false
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing load case that is to have its results deleted.
This item is ignored when the All item is True.
All (Optional)
Type: System.Boolean
 If this item is True, the results are deleted for all load cases, and the Name item is ignored.
Return Value
Type: Int32
 Returns zero if the results are successfully deleted; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'run analysis
       System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
       ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
       ret = SapModel.Analyze.RunAnalysis
   'delete load case results
       ret = SapModel.Analyze.DeleteResults("MODAL")
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cAnalyze Interface
ETABSv1 Namespace